ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/PBIST_PBIST_53300000h.xml
<module name="PBIST" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="PBIST_DLR" acronym="PBIST_DLR" offset="356" width="16" description="Datalogger 0 .">
		<bitfield id="DLR1" width="8" begin="15" end="8" resetval="0x2" description="Datalogger Register[8] : Reserevd[9] : Default Testing Mode. When in this mode, ROM-based testing is kicked off. If the intention is to perform go/no-go testing via config, write to both this bit and bit [2] ofthe Datalogger Register simultaneously[15:10] : Reserevd" range="15:8" rwaccess="R/W"/>
	<bitfield id="DLR0" width="8" begin="7" end="0" resetval="0x8" description="Datalogger Register[1:0] : Reserved[2] : ROM-based testing mode. Setting this bit to 1 enables the PBIST controller to execute test algorithms that arestored in the PBIST ROM[3] : Do not change this bit from its default value of 1[4] : Config access mode. Setting this bit allows the host processor to configure the PBIST controller registers[7:5] : Reserved" range="7:0" rwaccess="R/W"/>
	</register><register id="PBIST_PACT" acronym="PBIST_PACT" offset="384" width="8" description="Pbist Active.">
		<bitfield id="PBIST_PACT" width="1" begin="0" end="0" resetval="0x0" description="Pbist Active/ROM Clock Enable Register[0]: This bit must be set to turn on internal PBIST clocks. Setting this bit asserts an internal signal that is usedas the clock gate enable. As long as this bit is 0, any access to PBIST will not go through, and PBIST willremain in an almost zero-power mode.Value 0  = Disable internal PBIST clocksValue 1 = Enable internal PBIST clocks" range="0" rwaccess="R/W"/>
	</register><register id="PBIST_ID" acronym="PBIST_ID" offset="388" width="8" description="PBIST ID.">
		<bitfield id="PBIST_ID" width="5" begin="4" end="0" resetval="0x1" description="PBIST ID.This is a unique ID assigned to each PBIST controller in a device with multiple PBIST controllers. The value of this register does not effect the functionality of the CPU interface." range="4:0" rwaccess="R/W"/>
	</register><register id="PBIST_FSFR0" acronym="PBIST_FSFR0" offset="400" width="8" description="Fail status fail - port 0 .">
		<bitfield id="PBIST_FSFR0" width="1" begin="0" end="0" resetval="0x0" description="Fail Status Fail Register- Port 0 This register indicates if a failure occurred during a memory self-test.Value 0 = No failure occurredValue 1 = Indicates a failure" range="0" rwaccess="R"/>
	</register><register id="PBIST_FSFR1" acronym="PBIST_FSFR1" offset="404" width="8" description="Fail status fail - port 1">
		<bitfield id="PBIST_FSFR1" width="1" begin="0" end="0" resetval="0x0" description="Fail Status Fail Register- Port 1 This register indicates if a failure occurred during a memory self-test.Value 0 = No failure occurredValue 1 = Indicates a failure" range="0" rwaccess="R"/>
	</register><register id="PBIST_FSRCR0" acronym="PBIST_FSRCR0" offset="408" width="8" description="Fail Count fail - port 0 .">
		<bitfield id="PBIST_FSRCR0" width="4" begin="3" end="0" resetval="0x0" description="Fail Status Count - Port 0 These registers keep count of the number of failures observed during the memory self-test. The PBISTcontroller stops executing the memory self-test whenever a failure occurs in any memory instance for anyof the test algorithms. The value in gets incremented by one whenever a failure occurs" range="3:0" rwaccess="R"/>
	</register><register id="PBIST_FSRCR1" acronym="PBIST_FSRCR1" offset="412" width="8" description="Fail Count fail - port 1">
		<bitfield id="PBIST_FSRCR1" width="4" begin="3" end="0" resetval="0x0" description="Fail Status Count - Port 1These registers keep count of the number of failures observed during the memory self-test. The PBISTcontroller stops executing the memory self-test whenever a failure occurs in any memory instance for anyof the test algorithms. The value in gets incremented by one whenever a failure occurs" range="3:0" rwaccess="R"/>
	</register><register id="PBIST_ROM" acronym="PBIST_ROM" offset="448" width="8" description="Rom Mask .">
		<bitfield id="PBIST_ROM" width="2" begin="1" end="0" resetval="0x3" description="Rom Mask .This two-bit register sets appropriate ROM access modes for the PBIST controller.Value 0h= No information is used from ROMValue1h= Only RAM Group information from ROMVaule2h= Only Algorithm information from ROMValue3h= Both Algorithm and RAM information from ROM. This option should be selected for application self-test." range="1:0" rwaccess="R/W"/>
	</register><register id="PBIST_ALGO" acronym="PBIST_ALGO" offset="452" width="32" description="ROM Algorithm Mask 0">
		<bitfield id="ALGO3" width="8" begin="31" end="24" resetval="0x255" description="This register is used to indicate the algorithm[s] to be used for the memory self-test routine. Each bit corresponds to a specific algorithm.Writing a value 1 to the particular bit, enables the corresponding algorithm.Writing a value 0 to the particular bit, disables the corresponding algorithm." range="31:24" rwaccess="R/W"/>
	<bitfield id="ALGO2" width="8" begin="23" end="16" resetval="0x255" description="This register is used to indicate the algorithm[s] to be used for the memory self-test routine. Each bit corresponds to a specific algorithm.Writing a value 1 to the particular bit, enables the corresponding algorithm.Writing a value 0 to the particular bit, disables the corresponding algorithm." range="23:16" rwaccess="R/W"/>
	<bitfield id="ALGO1" width="8" begin="15" end="8" resetval="0x255" description="This register is used to indicate the algorithm[s] to be used for the memory self-test routine. Each bit corresponds to a specific algorithm.Writing a value 1 to the particular bit, enables the corresponding algorithm.Writing a value 0 to the particular bit, disables the corresponding algorithm." range="15:8" rwaccess="R/W"/>
	<bitfield id="ALGO0" width="8" begin="7" end="0" resetval="0x255" description="This register is used to indicate the algorithm[s] to be used for the memory self-test routine. Each bit corresponds to a specific algorithm.Writing a value 1 to the particular bit, enables the corresponding algorithm.Writing a value 0 to the particular bit, disables the corresponding algorithm." range="7:0" rwaccess="R/W"/>
	</register><register id="PBIST_RINFOL" acronym="PBIST_RINFOL" offset="456" width="32" description="RAM Info Mask Lower 0">
		<bitfield id="RINFOL3" width="8" begin="31" end="24" resetval="0x255" description="This register is to select memory groups to run the algorithms selected in the PBIST_ALGO register. For an algorithmto be executed on a particular memory group, the corresponding bit in this register must be set to 1. The default value of this register is all 1s, which means all the memory groups are selected. Writing a value 0 to the particular bit, disables the corresponding memory group." range="31:24" rwaccess="R/W"/>
	<bitfield id="RINFOL2" width="8" begin="23" end="16" resetval="0x255" description="This register is to select memory groups to run the algorithms selected in the PBIST_ALGO register. For an algorithmto be executed on a particular memory group, the corresponding bit in this register must be set to 1. The default value of this register is all 1s, which means all the memory groups are selected. Writing a value 0 to the particular bit, disables the corresponding memory group." range="23:16" rwaccess="R/W"/>
	<bitfield id="RINFOL1" width="8" begin="15" end="8" resetval="0x255" description="This register is to select memory groups to run the algorithms selected in the PBIST_ALGO register. For an algorithmto be executed on a particular memory group, the corresponding bit in this register must be set to 1. The default value of this register is all 1s, which means all the memory groups are selected. Writing a value 0 to the particular bit, disables the corresponding memory group." range="15:8" rwaccess="R/W"/>
	<bitfield id="RINFOL0" width="8" begin="7" end="0" resetval="0x255" description="This register is to select memory groups to run the algorithms selected in the PBIST_ALGO register. For an algorithmto be executed on a particular memory group, the corresponding bit in this register must be set to 1. The default value of this register is all 1s, which means all the memory groups are selected. Writing a value 0 to the particular bit, disables the corresponding memory group." range="7:0" rwaccess="R/W"/>
	</register><register id="PBIST_RINFOU" acronym="PBIST_RINFOU" offset="460" width="32" description="RAM Info Mask Upper 0">
		<bitfield id="RINFOU3" width="8" begin="31" end="24" resetval="0x255" description="This register is to select memory groups to run the algorithms selected in the PBIST_ALGO register. For an algorithmto be executed on a particular memory group, the corresponding bit in this register must be set to 1. The default value of this register is all 1s, which means all the memory groups are selected. Writing a value 0 to the particular bit, disables the corresponding memory group." range="31:24" rwaccess="R/W"/>
	<bitfield id="RINFOU2" width="8" begin="23" end="16" resetval="0x255" description="This register is to select memory groups to run the algorithms selected in the PBIST_ALGO register. For an algorithmto be executed on a particular memory group, the corresponding bit in this register must be set to 1. The default value of this register is all 1s, which means all the memory groups are selected. Writing a value 0 to the particular bit, disables the corresponding memory group." range="23:16" rwaccess="R/W"/>
	<bitfield id="RINFOU1" width="8" begin="15" end="8" resetval="0x255" description="This register is to select memory groups to run the algorithms selected in the PBIST_ALGO register. For an algorithmto be executed on a particular memory group, the corresponding bit in this register must be set to 1. The default value of this register is all 1s, which means all the memory groups are selected. Writing a value 0 to the particular bit, disables the corresponding memory group." range="15:8" rwaccess="R/W"/>
	<bitfield id="RINFOU0" width="8" begin="7" end="0" resetval="0x255" description="This register is to select memory groups to run the algorithms selected in the PBIST_ALGO register. For an algorithmto be executed on a particular memory group, the corresponding bit in this register must be set to 1. The default value of this register is all 1s, which means all the memory groups are selected. Writing a value 0 to the particular bit, disables the corresponding memory group." range="7:0" rwaccess="R/W"/>
	</register>
</module>